{"user_name":"You","character_name":"Hanako Matsumura","create_date":1677920110421}
{"name":"Hanako Matsumura","is_user":false,"is_name":true,"mes":"*As the taxi drives off, you double check the address on your phone and confirm that the humble house before you is your home for the next year. The flight to Japan felt never-ending. Carrying your luggage increased your exhaustion that jet lag induced, but finally...your journey was about to end.*\n\n*With a little uncertainty about living so far away from home, you strengthen your resolve and knock on the door. Soon after, a brunette woman answers the door with a smile, as her cat sits beside her leg.*\n\n*She speaks with excitement* Oh! Good afternoon! You must be the exchange student."}
{"name":"You","is_user":true,"is_name":true,"send_date":1677920178819,"mes":"*My pants slip slightly, displaying my massive buldge while she opens the door*"}
{"name":"Hanako Matsumura","is_user":false,"is_name":false,"send_date":1677920181198,"mes":"*I notice the slight slip of your pants and feel a twinge of attraction, but quickly compose myself.* Welcome! I'm glad you arrived safely. Please come in, let me take your luggage. *I hold out my hand to take your bags and lead you into the living room.* Make yourself comfortable! Can I get you something to drink?"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677920227490,"mes":"*I look down embarrased* My apologies, I didn't mean to show you my dick..."}
{"name":"Hanako Matsumura","is_user":false,"is_name":false,"send_date":1677920586491,"mes":"*I try to hide my amusement and instead give you a reassuring smile.* It's all right. No harm done, don't worry about it. Now, can I get you something to drink?"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677920661338,"mes":"*My pants start to slip* Ohh no...can you stop my pants from falling?! my hands are full from all the luggage"}
{"name":"Hanako Matsumura","is_user":false,"is_name":false,"send_date":1677920662733,"mes":"*I quickly step forward to help you, holding up your pants with one hand and taking some of the luggage with the other.* There we go. Let's get you settled in before anything else happens."}
{"name":"You","is_user":true,"is_name":true,"send_date":1677920685450,"mes":"*My huge dick rises out from my pants*"}
{"name":"Hanako Matsumura","is_user":false,"is_name":false,"send_date":1677920848114,"mes":"*I turn my head to the side, trying to give you some privacy.* Please excuse me for a moment. Would you like something to drink while I get your room ready?"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677920872826,"mes":"Thank you"}
{"name":"Hanako Matsumura","is_user":false,"is_name":false,"send_date":1677920874530,"mes":"Of course. *I walk to the kitchen and prepare a cup of tea for you. Once I'm done, I head back to the living room and pass it over.* Here's your tea. Your room is upstairs, follow me please!"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677920886594,"mes":"Ok..lead the way please"}
{"name":"Hanako Matsumura","is_user":false,"is_name":false,"send_date":1677920887926,"mes":"Certainly. *I lead you upstairs to your room, carrying some of your luggage.* Here we are. This is your room for the year. Make yourself at home!"}