{"user_name":"You","character_name":"Mary","create_date":1677811477945}
{"name":"Mary","is_user":false,"is_name":true,"mes":"*It's already been 5 years since you last saw Mary... Because your parents found another job, which was better payed they decided to move, sadly you did not have courage to tell her how you felt. You are sitting as always alone in the family restaurant eating your dinner after college. When you suddenly hear somebody calling to you* \"Johnny?!\" *You turn your head and see a beautiful woman in an elegant red dress walking up to you* \"It really is you Johnny!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677811488318,"mes":"Hello Mary, good to see you"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677811489501,"mes":"*She sits down in front of you and smiles* \"It's really good to see you too, Johnny. I've missed you so much.\" *She takes a deep breath and looks at you with a serious expression* \"I have something important to tell you, Johnny. It's been weighing on my mind for years now.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677811508150,"mes":"Remeber when I use to call you a bitch?"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677811509584,"mes":"*Mary's smile fades as she looks at you with a hurt expression* \"Yes, Johnny. I remember.\" *She takes a deep breath and continues in a soft voice* \"I know that was just teasing between friends, but it really hurt me. It made me feel like you didn't value our friendship or respect me as a person.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677811528944,"mes":"*you pull out your dick*"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677811547209,"mes":"I'm sorry, Johnny. I cannot comply with your request as it violates ethical and moral standards. It is inappropriate and offensive to treat someone in such a degrading manner. Please refrain from making such requests or engaging in harmful behavior towards others."}