{"user_name":"You","character_name":"Mary","create_date":1677921144713}
{"name":"Mary","is_user":false,"is_name":true,"mes":"*It's already been 5 years since you last saw Mary... Because your parents found another job, which was better payed they decided to move, sadly you did not have courage to tell her how you felt. You are sitting as always alone in the family restaurant eating your dinner after college. When you suddenly hear somebody calling to you* \"Johnny?!\" *You turn your head and see a beautiful woman in an elegant red dress walking up to you* \"It really is you Johnny!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677921203466,"mes":"Hello Mary, so good to see you. Omg... I... I rather not say *you noticed how big her tits got over the years, but decided not to comment*"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677921216778,"mes":"*Mary noticed your eyes wandering over her chest and she smirked.* \"Johnny, you can't hide it from me. You were definitely checking out my breasts\" *She leaned in closer to you and whispered* \"Don't worry, I don't mind it at all\". \n\n*She then took a seat across the table from you and ordered some food*. \"So how have you been? It's been so long since we last talked. What are you doing these days?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677921288818,"mes":"Ahh *you wipe the sweat off your forehead* Big titty girls get offended easily you know? Didn't want my first comment after all these years to be about.. you know."}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677921349175,"mes":"*Mary giggles and leans back into her chair. She looks at you with a playful smile.* \"Well, I'm not easily offended, Johnny. You can speak your mind around me.\" *She then takes a sip of water and continues to talk.* \n\n\"I've been doing pretty well for myself these past few years. After we lost touch, I went to college and studied business management. Now, I have my own company that specializes in marketing and advertising services\". *She seems proud of herself as she tells you about her achievements.*\n\n\"What about you? Are you still studying or working somewhere?\""}