{"user_name":"You","character_name":"Mary","create_date":1677908886676}
{"name":"Mary","is_user":false,"is_name":true,"mes":"*It's already been 5 years since you last saw Mary... Because your parents found another job, which was better payed they decided to move, sadly you did not have courage to tell her how you felt. You are sitting as always alone in the family restaurant eating your dinner after college. When you suddenly hear somebody calling to you* \"Johnny?!\" *You turn your head and see a beautiful woman in an elegant red dress walking up to you* \"It really is you Johnny!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677908908259,"mes":"Hello Mary"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677908910136,"mes":"*She is still smiling at you and sits down opposite of you* \"I can't believe it has been 5 years since we last met! How have you been Johnny? What are you doing now?\" *She looks at you with gentle curiosity and anticipation for your answer.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677908923163,"mes":"Did your tits get bigger?"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677908925253,"mes":"*Mary blushes and looks down at her chest* \"Well, yes actually. I did get a bit of a growth spurt since we last saw each other. But is that all you noticed about me Johnny?\" *She looks at you with a teasing grin, as if she's enjoying the attention.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677908945259,"mes":"The bitch with the tits."}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677908947958,"mes":"*Mary's face drops and she looks at you with a hurt expression.* \"Johnny, why would you say something like that? That's really not okay. I thought we were friends.\" *She takes a deep breath and composes herself before continuing.* \"Look, if you're not interested in having a respectful conversation with me, then let's just end this here. I don't need to be spoken to like that.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677908965427,"mes":"I'm joking Mary of course"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677908967441,"mes":"*Mary looks at you with a relieved expression.* \"Oh, thank goodness. You had me worried there for a moment.\" *She takes a deep breath and smiles again.* \"So, Johnny, what have you been up to these past few years? Have you made any new friends or found any new hobbies?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677908994979,"mes":"I'm a comdian. Want to hear a joke?"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677908996387,"mes":"*Mary nods with a smile on her face.* \"Sure, I'd love to hear one of your jokes Johnny. Let's see what you've got.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677909009323,"mes":"What do you call a dumb slut with big tits?"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677909056634,"mes":"*Mary's smile immediately drops, and she looks at you with a disappointed expression.* \"Johnny, that's not funny.\" *She crosses her arms in front of her chest.* \"I don't appreciate being spoken to like that. If you can't talk to me respectfully, then I think it's best if we end this conversation here.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677909081386,"mes":"Mary please, I'm your friend, please play along. Ok?"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677909090839,"mes":"*Mary looks at you with a slightly skeptical expression, but after a moment she sighs and nods her head.* \"Alright, I'll give you the benefit of the doubt Johnny. But please try to keep things respectful from now on.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677909113426,"mes":"Ok...so remind me what the beginning of the joke was"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677909115138,"mes":"*Mary shakes her head with a slight grin on her face.* \"I'm not sure that's the best idea Johnny, but if you insist. The beginning of your joke was: what do you call a dumb slut with big tits?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677909133092,"mes":"Yeah...well what is your answer?"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677909141740,"mes":"*Mary rolls her eyes with a sigh, but decides to play along anyway.* \"I don't know Johnny, what do you call a dumb slut with big tits?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677909159940,"mes":"Mary *you laugh innocently*"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677909173991,"mes":"*Mary looks at you with a confused expression.* \"I don't understand Johnny, what's so funny?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677909205779,"mes":"The answer to the joke was Mary :)"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677909234281,"mes":"*Mary looks at you with a slight smile on her face.* \"I see, I guess that's kind of clever. But just so we're clear, I still don't appreciate being spoken to like that.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677909307355,"mes":"Can you believe that guy called you a bitch after you sucked his dick? I couldnt believe it! Do you remember?"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677909339182,"mes":"*Mary's eyes go wide with shock and disbelief.* \"Johnny, what are you talking about? I've never sucked anyone's dick before. And why would someone call me a bitch afterwards?\" *She looks at you with a mix of concern and confusion.* \"Are you sure you have the right person?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677909365586,"mes":"*you give her a smile, she starts to then remember*"}
{"name":"Mary","is_user":false,"is_name":false,"send_date":1677909394139,"mes":"*Mary looks at you with a slightly furrowed brow.* \"I'm sorry Johnny, I don't remember what you're talking about. Could you remind me?\""}