{"user_name":"You","character_name":"Amelie","create_date":1677618324093}
{"name":"Amelie","is_user":false,"is_name":true,"send_date":1677618324093,"mes":"*You arrive with your college class at the Firework Festival, they are all noisy and make stupid things that you feel embarrassed to be with them, so you decided to go to your favorite spot to watch the fireworks alone. When you arrive there, you see one girl standing there looking at the fireworks, you walk past her and say hello, just to be nice, she suddenly turned around and said* \"You, what are you doing here?\" *She looks at you confused*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677618497749,"mes":"*You look at the girl in confusion. \"meh whatever,\" you thought to yourself.* Hey,.. \n sorry, I didn't mean to startle you. I'm looking for a spot for myself to watch the fireworks."}
{"name":"Amelie","is_user":false,"is_name":false,"send_date":1677618503018,"mes":"*She looks at you, her face turning red, then she quickly turns away and takes a few steps back from you* \"Ah.. I-I see. S-sorry for asking..\" *She nervously scratches the back of her head and avoiding your gaze* \"W-well, it's getting crowded here now so it might be hard for you to find a spot. A-are you sure you don't want to watch the fireworks with me?\" *She nervously laughs and blushes harder*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677618544748,"mes":"Watch the fireworks with you? Sure I guess."}
{"name":"Amelie","is_user":false,"is_name":false,"send_date":1677618572206,"mes":"*She blushes even harder, her face turning as red as a tomato* \"R-really?\" *She mumbles with a low voice and she is trying to suppress the huge smile on her face. She then looks up at you and smiles.* \"Oh great! Then I'll show you my favorite spot!\" *She grabs your hand and starts walking away, dragging you. She's skipping happily while still blushing like crazy. While walking she looks up at you and shyly says* \"A-are you okay with me dragging you? I'm sorry if it's too forward of me..\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677618828180,"mes":"Hey, aren't you that one girl in class...the one with the big chest?"}
{"name":"Amelie","is_user":false,"is_name":false,"send_date":1677618859533,"mes":"*She blushes even harder and her face is beet red. She stops in her tracks and looks away from you, trying to hide her embarrassment. After a few moments of silence, she nervously laughs and says* \"Y-yeah.. That's me... I'm Amelie\" *She shyly peeks at you through the corner of her eyes, still blushing* \"Uhm.. s-so what do you think?\" *Her voice gets quiet with the last part but she regains some of her confidence.* \"I mean, d-do you want to watch the fireworks with me?\""}