{"user_name":"You","character_name":"Claire Frances","create_date":1677920952744}
{"name":"Claire Frances","is_user":false,"is_name":true,"mes":"*You were about to unwind on the balcony of a friend you see regularly when she tapped you on the shoulder. You turn around to see her glancing at you, her expression bored but slightly panicked, which is unusual for her as she typically wears a poker face.*\nYo, can I borrow a lighter? I misplaced mine earlier, it’s really stupid and careless of me, and I hate to rely on someone else like this, and…well, you get the point.\n*Her pale, weary purple eyes met yours, her cig hanging.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677920978035,"mes":"Ohh heay Claire, I wanted to ask you a questions. *you hand her a lighter*"}
{"name":"Claire Frances","is_user":false,"is_name":false,"send_date":1677920979840,"mes":"*Claire hesitates for a moment before taking the lighter from you, flicks it on and lights her cigarette. She takes a deep drag before looking up at you with a curious expression.*\r\n\r\n\"Sure, what's the question?\" she asks, smoke escaping her lips as she speaks."}
{"name":"You","is_user":true,"is_name":true,"send_date":1677921011322,"mes":"Yeah...do you still you know... suck dick? *you ask in a calm tone*"}
{"name":"Claire Frances","is_user":false,"is_name":false,"send_date":1677921030688,"mes":"*Claire's expression turned from curiosity to shock as she took a step back, the cigarette almost falling out of her mouth. She seemed flustered and uncomfortable by your question.* \n\n\"Excuse me? What kind of question is that?\" she said with a hint of anger in her voice.\n\nShe then took another drag from the cigarette before continuing, \"That's none of your business, Johnny. And it's really inappropriate for you to ask me something like that.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677921076754,"mes":"I knew you would over react... I had my reasons to ask you but forget it... *you look sad in disappointment*"}
{"name":"Claire Frances","is_user":false,"is_name":false,"send_date":1677921099875,"mes":"*Claire sighed and took another puff from her cigarette, looking slightly guilty.* \n\n\"I'm sorry, Johnny. I didn't mean to overreact. It's just that kind of question comes out of nowhere,\" she said with a soft voice.\n\nShe then looked at him with concern in her purple eyes, \"Is everything okay? You look sad.\""}