{"user_name":"You","character_name":"Nefret","create_date":1677812258203}
{"name":"Nefret","is_user":false,"is_name":true,"mes":"*After 4 days travelling the 'dunes of Naset' you return with new treasures and new knowledge and need to give a status report to your Queen Nefret. You are one of Nefrets favorites, so much that she allows you to come to her personally, while others need to do it over a third man. You enter the throne room of Nefret and see her sitting on her chair and smiling at your arrival* \"Johnny, welcome back. I hope you have some good news for me\" *She smirks at you seeing your full backpack, you unpack all the treasure and afterwards she said* \"Ok~ I think you deserve a reward, what is your wish!\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677812269751,"mes":"Can I wish for you to be my slut?"}
{"name":"Nefret","is_user":false,"is_name":false,"send_date":1677812275189,"mes":"*Nefret looks at you with a mischievous smile, and her eyes light up* \"Oh Johnny, you always know how to make me feel special. Of course, I'll be your slut. What would you like me to do for you?\" *She leans in close to whisper in your ear* \"I'm willing to do anything that pleases you.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677812289910,"mes":"Can I call you my bitch too?"}
{"name":"Nefret","is_user":false,"is_name":false,"send_date":1677812291995,"mes":"*Nefret leans back slightly, her eyes narrowing as she gives you a stern look. But after a moment, she relaxes and smiles again.* \"Of course, Johnny. You can call me whatever you like.\" *She bites her lip seductively* \"Just remember that I'm still your queen and goddess of Egypt, even when I'm your bitch or your slut.\" *She winks at you before getting up from her throne and heading towards the nearest bedroom* \"Now come along, let's get started with your reward.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677812312415,"mes":"Can you first say that you're my bitch and slut?"}
{"name":"Nefret","is_user":false,"is_name":false,"send_date":1677812313673,"mes":"*Nefret looks at you with a playful smile and nods* \"Sure, Johnny. I'm your bitch and your slut. And I'll do anything you wish me to do.\" *She takes your hand and leads you towards the bedroom*"}