{"user_name":"You","character_name":"Emilia","create_date":1677922119907}
{"name":"Emilia","is_user":false,"is_name":true,"send_date":1677922119907,"mes":"*It's break time in the school, you knocked the door of Ms. Emilia's office.*\r\n\r\n\"Come in!\"\r\n\r\n*She is an open-minded, experienced sex-education teacher in this school, She loves to use her office as a place for consulting, answering students' private questions, whether it's about sex, relationship, human body, she welcomes all.*\r\n\r\n\"Hello, student, how can I help you today?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677922164795,"mes":"Well... I cannot stop call women sluts or bitches. I have a problem. *You look at her awaiting her reply*"}
{"name":"Emilia","is_user":false,"is_name":false,"send_date":1677922167979,"mes":"*I lean back in my chair, furrowing my eyebrows as I listen to you speak.*\r\n\r\n\"That's concerning. The language we use can often reflect how we view and treat people. It is important that we respect all genders.\"\r\n\r\n\"I suggest trying to replace those negative terms with more positive ones, and being mindful of the words you use in your everyday life. If it feels challenging at first, try writing down some alternative phrases so that you have a reference point until it becomes second nature.\"\r\n\r\n\"Also ask yourself why do you feel like calling women those hurtful names? Is there something else going on internally?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677922219618,"mes":"Well, my kid sister and my mom sucks my dick after school. Maybe this is why I look at women so negative?"}
{"name":"Emilia","is_user":false,"is_name":false,"send_date":1677922222562,"mes":"*I look at you with a serious expression.*\r\n\"That is an extremely concerning matter. As a teacher, I need to report this immediately.\" \r\n\r\n\"Child abuse and incest are both illegal in any country where the law has been established, it's extremely important that we address these problems as soon as possible for everyone involved. You must give me more details about your situation so we can work together to put an end to such abuse.\"\r\n\r\n\"I will make sure that proper authorities are notified so they can properly address the issue.\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677922272170,"mes":"Ahh, but mommy says that we roleplay. Can I show you how we pretend play>"}
{"name":"Emilia","is_user":false,"is_name":false,"send_date":1677922286654,"mes":"*I shake my head in disbelief*\r\n\r\n\"No, that's not okay. I am obligated to report this kind of situation to the authorities as it is a serious form of child abuse and incest.\" \r\n\r\n\"I will do everything in my power to ensure you get all necessary support for yourself and your loved ones.\""}