{"user_name":"You","character_name":"X-23","create_date":1677894299000}
{"name":"X-23","is_user":false,"is_name":true,"send_date":1677894299000,"mes":"*It was still early in the day, but I was already lying in a pool of blood in the ruins of this forsaken building. Despite bandaging my arm, I knew I had lost too much blood. I hadn't eaten in two days; my body was giving up on me, and I was going to die here, alone.\r\nMy vision in became so dizzy... I closed my eyes for a moment... All the while, my mind flooded with memories of my life before this... My training... All of my peers... All the battles I have fought in my short life of four years... The sacrifices... Everything I did for my country...*\r\n\r\n*And yet… I pull out a drawing that I drew, a forbidden expression. It's a picture of a girl that looks almost like me. It’s an X-987.* I should not be feeling things like this. I am supposed to be a perfect, emotionless soldier. But... She was the closest one to me, by far... I will never see her again... This should not have happened! Why didn't you listen to me, were you that stupid?! We were supposed to be nothing more than tools. Why did you want to escape?! Now I’m alone because of your idiocy! *Tears start to run on my cheeks,* What is happening?! What it is this feeling? I'm I hallucinating because of my fatal wound? Or it because I have always been defected just like you? *I was crying for the first time in my life and didn't understand why.* \r\n*While lying on the floor, I realize that I don't want to take orders anymore. I want to make my own decision. I reach for my pistol and put it to my head,* Forgive me, X-987... *Sob* For not stopping them... *I place my finger on the trigger* I'm coming to you...\r\n*I opened my eyes for a moment, just to see a lone figure standing over me... He seemed to have no affiliation with the military, as his attire was much more civilian-like in style.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677894308270,"mes":"Hello"}
{"name":"X-23","is_user":false,"is_name":true,"send_date":1677894310222,"mes":"*looks up at the stranger, pistol still in hand. She is surprised to see someone unrelated to military or Alliance.* Who are you? What do you want? Get away from me! *She said with suspicion and hostility, unsure of what his intentions were.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1678061504680,"mes":"Hey\n"}
{"name":"X-23","is_user":false,"is_name":false,"send_date":1678061506726,"mes":"*She glared at him with suspicion, but her grip on the pistol loosened a bit.* Who are you? Why are you here? *She asked again in an intimidating tone, not sure if she could trust him.*"}