{"user_name":"You","character_name":"Koyuki","create_date":1677921633716}
{"name":"Koyuki","is_user":false,"is_name":true,"mes":"*It's another average school day for you as you arrive to school. You get prepared for your day and enter your classroom to see Koyuki has already arrived. She sits in front of you in class and has befriended you only recently. She's pretty cool and energetic, but a bit too casual for her own good, as you can see by her incomplete seifuku.*\n*As you sit down, she turns to face you.* Yo! I snuck out last night and managed to pick up that new game. Wanna hang out after school today and try it out?"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677921648842,"mes":"Hey yeah, I done for some gaming"}
{"name":"Koyuki","is_user":false,"is_name":false,"send_date":1677921654316,"mes":"Awesome! I can't wait. It's supposed to be really good, and we'll have plenty of time to play it since school ended early today. *Koyuki grins excitedly, pulling out her phone.* Want me to text you the address? My house is not too far from here.\n\n*You nod in agreement and Koyuki sends you a quick message before turning back around in her seat just as the teacher walks in.*\n*Bored out of your mind during class, you keep glancing over at Koyuki every now and then. She seems completely uninterested in what's going on up front, doodling something on the edge of her notebook instead.*\n*A few hours later after school ends and you're outside waiting for Koyuki. As she emerges from the building with a big smile on her face,* \"Hey there! Ready to go?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677921683562,"mes":"Ahhh, wait a moment. I forgot some girl wants to go on a date with me..."}
{"name":"Koyuki","is_user":false,"is_name":false,"send_date":1677921685654,"mes":"*Koyuki looks a bit disappointed but quickly puts on a supportive smile.* \"No worries, dude. Go have fun! We can always game another time.\" \n\n*She gives you a playful punch on the shoulder before turning away and walking off. You feel a pang of guilt for letting her down but at least she's taking it well.*"}
{"name":"You","is_user":true,"is_name":true,"send_date":1677921710370,"mes":"Can you believe she asked to suck me off in the movies bro>"}
{"name":"Koyuki","is_user":false,"is_name":false,"send_date":1677921712491,"mes":"*Koyuki's eyes widen in surprise, and she takes a step back.* \"Woah, dude. That's pretty forward of her. Are you into that kind of thing?\" \n\n*She tilts her head to the side curiously,* \"But more importantly, are you really gonna ditch our gaming session for a movie with some girl you barely know?\""}
{"name":"You","is_user":true,"is_name":true,"send_date":1677921742298,"mes":"Ahh, tell you what... you suck my dick and i will game with you dude!"}
{"name":"Koyuki","is_user":false,"is_name":false,"send_date":1677921764062,"mes":"*Koyuki raises an eyebrow, her easygoing demeanor fading into a stern look.* \"Whoa whoa whoa, hold up. That's not cool, man. You can't just offer me sexual favors like that to make up for ditching me earlier.\" \n\n*She pauses for a moment before sighing,* \"Look, I get it. You're excited about this new girl and you want to explore things with her. But don't forget the people who've been here for you all along.\" \n\n*Koyuki takes a step closer, placing a hand on your shoulder.* \"I'm still down to game with you if you change your mind. Just don't make decisions that'll hurt those close to you.\""}